Repository: 84000/data-translation-memory
Catalog: toh643-v3.tmx
Source language: bo
Languages: en

source: འཕགས་པ་བྱམས་པས་དམ་བཅས་པ་ཞེས་བྱ་བའི་གཟུངས།
en: The Noble Dhāraṇī Maitreya’s Pledge

source: དཀོན་མཆོག་གསུམ་ལ་ཕྱག་འཚལ་ལོ། །
en: Homage to the Three Jewels.

source: རྒྱལ་བ་བྱམས་པ་ལ་ཕྱག་འཚལ་ལོ། །ན་མོ་རཏྣ་ཏྲ་ཡཱ་ཡ། ན་མོ་བྷ་ག་བ་ཏེ།
en: Homage to Maitreya the Victorious One.

source: ཤཱཀྱ་མུ་ན་ཡེ། ཏ་ཐཱ་ག་ཏཱ་ཡ། ཨརྷ་ཏེ་སཾ་མྱཀྶཾ་བུདྡྷཱ་ཡ། ཏདྱ་ཐཱ། ཨོཾ་ཨ་ཛི་ཏེ། ཨ་ཛི་ཏེ། ཨ་པ་རཱ་ཛི་ཏེ། ཨ་ཛི་ཏན་ཛ་ཡ། ཧ་ར་ཧ་ར། མཻ་ཏྲི་ཨ་བ་ལོ་ཀི་ཏེ། ཀ་ར་ཀ་ར། མ་ཧཱ་ས་མ་ཡ་སིདྡྷེ། བྷ་ར་བྷ་ར།
en: namo ratna trayāya | namo bhagavate | śākyamunaye | tathāgatāya | arhate samyaksaṃ­buddhāya | tadyathā | oṃ ajite ajite | aparājite | ajitaṃ jaya | hara hara | maitri avalokite | kara kara | mahā­samaya­siddhe | bhara bhara | mahābodhi­maṇḍabīje | smara smara | asmakaṃ samaya bodhi bodhi | mahābodhi svāhā | | This was the root mantra.

source: མ་ཧཱ་བོ་དྷི་མཎྜ་བཱི་ཛེ། སྨར་སྨར། ཨསྨ་ཀཾ་ས་མ་ཡ་བོ་དྷི་བོ་དྷི། མ་ཧཱ་བོ་དྷི་སྭཱ་ཧཱ། རྩ་བའི་གསང་སྔགས་སོ། །
en: oṃ mohi mohi | mahāmohi svāhā | | This was the heart mantra.

source: ཨོཾ་མོ་ཧི་མོ་ཧི། མ་ཧཱ་མོ་ཧི་སྭཱ་ཧཱ། སྙིང་པོའོ། །ཨོཾ་མུ་ནི་མུ་ནི་སྨ་ར་སྭཱ་ཧཱ། ཉེ་བའི་སྙིང་པོའོ། །
en: oṃ muni muni smara svāhā | | This was the auxiliary heart mantra.

source: གཟུངས་འདི་ཉན་པ་ཙམ་དང་། ཀློག་པ་དང་། ཁ་ཏོན་བྱེད་པ་དང་། ཚུལ་བཞིན་ཡིད་ལ་སེམས་པ་དང་། བསྒོམ་པ་ཙམ་གྱིས་གང་གི་ཚེ་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པར་གྱུར་པ་ན། བདག་གིས་སེམས་ཅན་དེ་ངེས་པར་བཙལ་བར་བགྱི་སྟེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་པར་བགྱིའོ། །
en: “Once I have fully awakened to unsurpassed and perfectly complete enlightenment, I will be certain to search out any being who simply hears, recites, chants, correctly contemplates, or meditates on this dhāraṇī and offer them a prophecy for unsurpassed and perfectly complete enlightenment.

source: ཐ་ན་དུད་འགྲོའི་སྐྱེ་གནས་སུ་གྱུར་པའི་རི་དགས་དང་། བྱ་རྣམས་ཀྱི་རྣ་ཁུང་དུ་སྒྲོགས་པར་བྱེད་ན། དེ་དག་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་པ་འཐོབ་བོ། །
en: Even if this dhāraṇī is recited into the ear of a deer or bird from the animal realm, they will also receive a prophecy for unsurpassed and perfectly complete enlightenment.

source: འདི་ཐོས་པ་ཙམ་གྱིས་ནམ་དུ་ཡང་ངན་སོང་དུ་འགྲོ་བར་མི་འགྱུར་རོ། །ངན་སོང་གི་དྲི་མས་ཀྱང་མི་གོས་སོ། །
en: Whoever merely hears this will never go to the lower realms, nor will they be stained by the dirt of the lower realms.

source: མའི་མངལ་དུ་ཡང་མི་སྐྱེའོ། །
en: They will not be reborn in a mother’s womb.

source: ལྷའི་བསྐལ་པ་སྟོང་དུ་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོར་འགྱུར་རོ། །
en: They will become a universal monarch for a thousand divine eons.

source: དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་དང་ལྡན་པར་འགྱུར་རོ། །
en: They will inhabit the path of the ten virtuous actions.

source: ཇི་ལྟར་བསམས་ཤིང་དོན་དུ་གཉེར་བའི་ལོངས་སྤྱོད་འགྲུབ་པར་འགྱུར་རོ། །
en: Whichever material enjoyments they wish for and seek will appear for them.

source: བཅོམ་ལྡན་འདས་བདག་གིས་ཀྱང་སེམས་ཅན་དེ་བསྐྱུད་པར་མི་བགྱི་ལགས་སོ། །
en: I, a blessed one, will never forget that being.

source: ངེས་པར་བདག་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་མཆིས་ནས། དེ་ཇི་ལྟར་གྱུར་ཀྱང་རུང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་པར་བགྱིའོ། །
en: Having reached the seat of awakening, I will absolutely provide them, no matter who they are, a prophecy for unsurpassed and perfectly complete enlightenment.”

source: འཕགས་པ་བྱམས་པས་དམ་བཅས་པ་ཞེས་བྱ་བའི་གཟུངས་རྫོགས་སོ།། །།
en: This completes The Noble Dhāraṇī “Maitreya’s Pledge.”

source: རྒྱ་གར་གྱི་མཁན་པོ་བཛྲ་པཱ་ཎི་དང་། བོད་ཀྱི་ལོ་ཙྪ་བ་དགེ་སློང་ཆོས་ཀྱི་ཤེས་རབ་ཀྱིས་བསྒྱུར་ཅིང་ཞུས་ཏེ་གཏན་ལ་ཕབ་པ།།
en: Translated, edited, and finalized by the Indian preceptor Vajrapāṇi and the Tibetan translator-monk Chökyi Sherap.
